In [16]:
import pandas as pd

In [17]:
dados = pd.read_csv('dados/sales_train.csv')

In [18]:
dados.head()

         data  mes_consecutivo  loja_id  item_id  preco_item  venda_item_dia
0  02.01.2013                0       59    22154      999.00             1.0
1  03.01.2013                0       25     2552      899.00             1.0
2  05.01.2013                0       25     2552      899.00            -1.0
3  06.01.2013                0       25     2554     1709.05             1.0
4  15.01.2013                0       25     2555     1099.00             1.0

In [21]:
a_renomear = {
    'date' : 'data',
    'date_block_num' : 'mês_consecutivo',
    'shop_id': 'loja_id',
    'item_id' : 'item_id',
    'item_price' : 'preço_item',
    'item_cnt_day' : 'venda_item_dia' 
}
dados = dados.rename(columns=a_renomear)

In [23]:
a_renomear = {
    'mês_consecutivo' : 'mes_consecutivo',
    'preço_item' : 'preco_item', 
}
dados = dados.rename(columns=a_renomear)

In [24]:
dados.head()

         data  mes_consecutivo  loja_id  item_id  preco_item  venda_item_dia
0  02.01.2013                0       59    22154      999.00             1.0
1  03.01.2013                0       25     2552      899.00             1.0
2  05.01.2013                0       25     2552      899.00            -1.0
3  06.01.2013                0       25     2554     1709.05             1.0
4  15.01.2013                0       25     2555     1099.00             1.0

In [10]:
dados.shape

(2935849, 6)

In [11]:
dados_teste = pd.read_csv('dados/test.csv')

In [12]:
dados_teste.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [13]:
dados.isnull().sum()

data               0
mês_consecutivo    0
loja_id            0
item_id            0
preço_item         0
venda_item_dia     0
dtype: int64

In [14]:
dados_teste.isnull().sum()

ID         0
shop_id    0
item_id    0
dtype: int64

In [25]:
dados.to_csv('dados/sales_train.csv',index=False)

In [5]:
data = pd.read_csv('dados/items.csv')

In [6]:
data.head()

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40

In [8]:
data1 = pd.read_csv('dados/item_categories.csv')

In [9]:
data1.head()

        item_category_name  item_category_id
0  PC - Гарнитуры/Наушники                 0
1         Аксессуары - PS2                 1
2         Аксессуары - PS3                 2
3         Аксессуары - PS4                 3
4         Аксессуары - PSP                 4

In [11]:
df = pd.read_csv('dados/sample_submission.csv')

In [12]:
df.head()

   ID  item_cnt_month
0   0             0.5
1   1             0.5
2   2             0.5
3   3             0.5
4   4             0.5

In [14]:
df1 = pd.read_csv('dados/shops.csv')

In [15]:
df1.head()

                        shop_name  shop_id
0   !Якутск Орджоникидзе, 56 фран        0
1   !Якутск ТЦ "Центральный" фран        1
2                Адыгея ТЦ "Мега"        2
3  Балашиха ТРК "Октябрь-Киномир"        3
4        Волжский ТЦ "Волга Молл"        4

In [ ]:
dados['venda_mes'] = 0
lista = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33]
for i in range(34):              
    selecao = dados['mes_consecutivo'] == i
    dados[selecao]['venda_mes'] = dados['mes_consecutivo'].apply(lambda x:dados[selecao]['venda_item_dia'].sum() if x in lista else x)